Plan status: `success`
<details>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # azurerm_network_security_group.hub[0m will be created
[0m  [32m+[0m[0m resource "azurerm_network_security_group" "hub" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m location            = "eastus"
      [32m+[0m[0m name                = "hub-security-group"
      [32m+[0m[0m resource_group_name = "hub-resources"
      [32m+[0m[0m security_rule       = (known after apply)
    }

[1m  # azurerm_resource_group.hub[0m will be created
[0m  [32m+[0m[0m resource "azurerm_resource_group" "hub" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "eastus"
      [32m+[0m[0m name     = "hub-resources"
    }

[1m  # azurerm_virtual_network.hub[0m will be created
[0m  [32m+[0m[0m resource "azurerm_virtual_network" "hub" {
      [32m+[0m[0m address_space       = [
          [32m+[0m[0m "10.0.0.0/16",
        ]
      [32m+[0m[0m dns_servers         = [
          [32m+[0m[0m "10.0.0.4",
          [32m+[0m[0m "10.0.0.5",
        ]
      [32m+[0m[0m guid                = (known after apply)
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m location            = "eastus"
      [32m+[0m[0m name                = "hub-network"
      [32m+[0m[0m resource_group_name = "hub-resources"
      [32m+[0m[0m subnet              = [
          [32m+[0m[0m {
              [32m+[0m[0m address_prefix = "10.0.1.0/24"
              [32m+[0m[0m id             = (known after apply)
              [32m+[0m[0m name           = "subnet1"
              [32m+[0m[0m security_group = ""
            },
          [32m+[0m[0m {
              [32m+[0m[0m address_prefix = "10.0.2.0/24"
              [32m+[0m[0m id             = (known after apply)
              [32m+[0m[0m name           = "subnet2"
              [32m+[0m[0m security_group = (known after apply)
            },
        ]
      [32m+[0m[0m tags                = {
          [32m+[0m[0m "environment" = "Production"
        }
    }

[1mPlan:[0m 3 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Saved the plan to: Production.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "Production.plan"

```

</details>

*Pusher: @satishkarengula, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*